### <center><h2> INGENIERÍA EN BIOTECNOLOGÍA</h2></center>
# <center><h1 style="color:red">GBI6 - BIOINFORMÁTICA</h1></center>

<img src="https://www.ikiam.edu.ec/img/logo-ikiam-grey.png" width=400 height=300 />

# PANDAS

Este contenido se basa en la demosración de [10 Minutes Introduction](http://pandas.pydata.org/pandas-docs/stable/10min.html), y el tutorial de [pandas tutorials](http://pandas.pydata.org/pandas-docs/stable/tutorials.html).

Se puede revisar algunas formas rápidas de trabajar en Jupyrer en: [Jupyter keyboard shortcuts](https://www.cheatography.com/weidadeyue/cheat-sheets/jupyter-notebook/).

# Librerías

In [1]:
# this will enable some additional autocompletion using the tab button

%config IPCompleter.greedy=True

In [4]:
import pandas as pd
import numpy as np # Trabaja con listas y numericas 
%matplotlib inline
import matplotlib as mp # graficos 
import seaborn as sb # estadistica y visualizacion
!pip install pandas

Requirement already satisfied: pandas in c:\users\juan carlos\anaconda3\lib\site-packages (1.4.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\juan carlos\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: numpy>=1.18.5 in c:\users\juan carlos\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\juan carlos\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\juan carlos\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

# Crear series de datos y mostrar

Crea una lista de nombre ```lista``` y luego convierte a un objeto de tipo Serie de nombre ```s```. Imprime su contenido.

| S   |
|-----|
| 1.0 |
| 1.5 |
| 3.0 |
| 4.3 |
| 8.2 |

In [5]:
lista = [1, 1.5, 3, 4.3, 8.2]
s = pd.Series(lista)# series argumento para comvertir una lista en una tabla  
print(type(lista))
print(type(s))
print(s)
np.average(s)

<class 'list'>
<class 'pandas.core.series.Series'>
0    1.0
1    1.5
2    3.0
3    4.3
4    8.2
dtype: float64

3.6

In [7]:
pd.DataFrame(lista)

     0
0  1.0
1  1.5
2  3.0
3  4.3
4  8.2

# Crea un DataFrame con valores en filas y columnas

Crea un dataframe con la información que se muestra en la siguiente tabla.

|index   |a |b  |c   |d           |e |
|--------|--|---|----|------------|--|
|1       |2 |3  |5.  |caballo     |13|
|2       |3 |1  |1.4 |gato        |11|
|3       |4 |9  |1.2 |perro       |  |
|4       |5 |12 |0.8 |tortuga     |  |
|5       |6 |2  |2.3 |conejoo     |9 |

Luego realiza lo siguiente
* Accede a los valores de alguna fila
* Accede a los valores de alguna(s) celda(s)
* Imprime los índices
* Imprime los nombres de columna
* Accede a los valores de una columna
* Renombra alguna columna
* Extrae y guarda la información en un nuevo dataframe
* Obten una descripción y las estadísticas elementales del dataframe

In [10]:
t1=pd.DataFrame(lista)
t1.mean()

0    3.6
dtype: float64

In [11]:
# Crear la data
df2 = pd.DataFrame({'a' : [2,3,4,5,6],
                    'b' : [3,1,9,12,2],
                    'c' : [5.0, 1.4, 1.2, 0.8, 2.3],
                    'd' : pd.Categorical(['caballo', 'gato', 'perro', 'tortuga', 'conejo']),
                    'e' : [13, 11, None, None, 9]}, index=[1,2,3,4,5]) # Key, value el dataframe no es nada mas que una lista 
df2

   a   b    c        d     e
1  2   3  5.0  caballo  13.0
2  3   1  1.4     gato  11.0
3  4   9  1.2    perro   NaN
4  5  12  0.8  tortuga   NaN
5  6   2  2.3   conejo   9.0

Para leer cada fila, se utiliza el comando ```iloc``` que itera desde el valor ```0``` hasta el último valor de fila. 

Para agregar el identificador de columna, se puede utilizar el comando ```loc``` que acepta identificadores.

In [13]:
df2["c"].mean()
# para sacar la media de un valor que esta dentro de un data frame segun el

2.1399999999999997

In [14]:
df2["b"].mean()

5.4

In [16]:
df2.iloc[2, 3] # llamo segun la numeracion dada para python  [primero filas y despues columnas]

'perro'

In [18]:
df2.iloc[:,2]# [:] significa todos los elementos

1    5.0
2    1.4
3    1.2
4    0.8
5    2.3
Name: c, dtype: float64

In [20]:
df2.iloc[1:3:,3]

2     gato
3    perro
Name: d, dtype: category
Categories (5, object): ['caballo', 'conejo', 'gato', 'perro', 'tortuga']

In [7]:
df2.loc[2,'d'] # para tablas para colocar el nombre de columanas

'gato'

In [9]:
# Todas las filas 
for i in range(0, len(df2)):
    print(df2.iloc[i, :])

a          2
b          3
c        5.0
d    caballo
e       13.0
Name: 1, dtype: object
a       3
b       1
c     1.4
d    gato
e    11.0
Name: 2, dtype: object
a        4
b        9
c      1.2
d    perro
e      NaN
Name: 3, dtype: object
a          5
b         12
c        0.8
d    tortuga
e        NaN
Name: 4, dtype: object
a         6
b         2
c       2.3
d    conejo
e       9.0
Name: 5, dtype: object

In [10]:
# Todas las columnas 
for i in range(0, len(df2.columns)):
    print(df2.iloc[:,i])

1    2
2    3
3    4
4    5
5    6
Name: a, dtype: int64
1     3
2     1
3     9
4    12
5     2
Name: b, dtype: int64
1    5.0
2    1.4
3    1.2
4    0.8
5    2.3
Name: c, dtype: float64
1    caballo
2       gato
3      perro
4    tortuga
5     conejo
Name: d, dtype: category
Categories (5, object): ['caballo', 'conejo', 'gato', 'perro', 'tortuga']
1    13.0
2    11.0
3     NaN
4     NaN
5     9.0
Name: e, dtype: float64

In [99]:
# Indices de fila y nombres de columna
print(df2.index)
print(df2.columns)

Int64Index([1, 2, 3, 4, 5], dtype='int64')
Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [62]:
# Utilizar nombre de columna para acceder a la data
print(df2.loc[:,'d'])

1    caballo
2       gato
3      perro
4    tortuga
5     conejo
Name: d, dtype: category
Categories (5, object): ['caballo', 'conejo', 'gato', 'perro', 'tortuga']

In [11]:
# Renombrar columnas
df2.columns = ['longitud', 'ancho', 'masa', 'nombre_comun', 'observaciones']
print(df2.columns.tolist()) # tolist a estos nombres de columna los voy a extraer y voy a imprimirlos como lista 
print(df2)

['longitud', 'ancho', 'masa', 'nombre_comun', 'observaciones']
   longitud  ancho  masa nombre_comun  observaciones
1         2      3   5.0      caballo           13.0
2         3      1   1.4         gato           11.0
3         4      9   1.2        perro            NaN
4         5     12   0.8      tortuga            NaN
5         6      2   2.3       conejo            9.0

In [36]:
# Extraer una seccion de la data y guardar en una nueva dataframe
df_3 = df2.iloc[2:5, 1:4]
print(df_3)

   longitud  ancho  masa
2         4      9   1.2
3         5     12   0.8
4         6      2   2.3

In [37]:
# Resumen de datos
df2.describe(percentiles=None, include=None, exclude=None)# percentiles no, include = exclude= elimina datos aucentes 
# describe = describe la media, desviacion estandar, minimo, cuartiles de 25,50,75

       Unnamed: 0  longitud      ancho      masa  observaciones
count    5.000000  5.000000   5.000000  5.000000            3.0
mean     3.000000  4.000000   5.400000  2.140000           11.0
std      1.581139  1.581139   4.827007  1.690562            2.0
min      1.000000  2.000000   1.000000  0.800000            9.0
25%      2.000000  3.000000   2.000000  1.200000           10.0
50%      3.000000  4.000000   3.000000  1.400000           11.0
75%      4.000000  5.000000   9.000000  2.300000           12.0
max      5.000000  6.000000  12.000000  5.000000           13.0

# Guardar la información

Para exportar se utiliza el comando ```nombredataframe.to_csv()```. Se tiene varios criterios que se pueden definir.

In [38]:
df2.to_csv('data.csv', header=True, index=True, sep='\t', mode='w')

# Data Import

Importar la información de ```data.csv``` en un dataframe de nombre _df2_:

In [26]:
df2 = pd.read_csv('data.csv', header=0, sep=';')
print(df2)

   Unnamed: 0  longitud  ancho  masa nombre_comun  observaciones
0           1         2      3   5.0      caballo           13.0
1           2         3      1   1.4         gato           11.0
2           3         4      9   1.2        perro            NaN
3           4         5     12   0.8      tortuga            NaN
4           5         6      2   2.3       conejo            9.0

Importar la misma data ahora a un archivo _df3_:

In [33]:
import pandas as pd

In [35]:
df4= pd.read_excel("dengue.xlsx") # ""
df4.to_csv("dengue.cvs", header= True, index=False, sep=";", mode=w")

In [ ]:
df4.to_csv("dengue.cvs", header= True, index=False, sep=";", mode "w")

In [115]:
df3 = pd.read_csv('data.csv', header=0, sep=';') #  vamos a leer header= identidicar como nombre de columna a la columna 0 para señalar donde esta el encabazado 
print(df3) # sep es el delimitado por "comas, tab, espacios vacios, "

  ,Unnamed: 0,longitud,ancho,masa,nombre_comun,observaciones
0                           0,1,2,3,5.0,caballo,13.0
1                              1,2,3,1,1.4,gato,11.0
2                                 2,3,4,9,1.2,perro,
3                              3,4,5,12,0.8,tortuga,
4                             4,5,6,2,2.3,conejo,9.0

In [30]:
pd.read_spss

# Filtrado de datos en un DataFrame
Usando la data de _df2_:

* Seleccione los valore de la 3er columna que son mayores que 2
* select rows that contain values greater than 2 in the 3rd column or 'cat' in the 4th column
* drop rows with missing data
* drop duplicate rows
* drop 1st column from dataframe
* sort rows by 2nd column
* convert Strings in 4th column to title-case

In [116]:
print(df2.columns.tolist())

['Unnamed: 0', 'Unnamed: 0.1', 'longitud', 'ancho', 'masa', 'nombre_comun', 'observaciones']

In [15]:
# select rows that contain values greater than 2 in the 3rd column or 'cat' in the 4th column
df2.loc[(df2['masa'] > 2) & (df2['nombre_comun'] == 'gato')]

Empty DataFrame
Columns: [Unnamed: 0, longitud, ancho, masa, nombre_comun, observaciones]
Index: []

In [ ]:
df3.loc[df3["nombre_comun"]]== "conejo"

In [43]:
df5= pd.read_csv("iris.csv")
df5

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [45]:
df5.loc[df5["Species"] == "Iris-setosa"] # coloca un valor total en una colimna de species

    Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0    1            5.1           3.5            1.4           0.2  Iris-setosa
1    2            4.9           3.0            1.4           0.2  Iris-setosa
2    3            4.7           3.2            1.3           0.2  Iris-setosa
3    4            4.6           3.1            1.5           0.2  Iris-setosa
4    5            5.0           3.6            1.4           0.2  Iris-setosa
5    6            5.4           3.9            1.7           0.4  Iris-setosa
6    7            4.6           3.4            1.4           0.3  Iris-setosa
7    8            5.0           3.4            1.5           0.2  Iris-setosa
8    9            4.4           2.9            1.4           0.2  Iris-setosa
9   10            4.9           3.1            1.5           0.1  Iris-setosa
10  11            5.4           3.7            1.5           0.2  Iris-setosa
11  12            4.8           3.4            1.6           0.2  Iris-setosa
12  13            4.8           3.0            1.4           0.1  Iris-setosa
13  14            4.3           3.0            1.1           0.1  Iris-setosa
14  15            5.8           4.0            1.2           0.2  Iris-setosa
15  16            5.7           4.4            1.5           0.4  Iris-setosa
16  17            5.4           3.9            1.3           0.4  Iris-setosa
17  18            5.1           3.5            1.4           0.3  Iris-setosa
18  19            5.7           3.8            1.7           0.3  Iris-setosa
19  20            5.1           3.8            1.5           0.3  Iris-setosa
20  21            5.4           3.4            1.7           0.2  Iris-setosa
21  22            5.1           3.7            1.5           0.4  Iris-setosa
22  23            4.6           3.6            1.0           0.2  Iris-setosa
23  24            5.1           3.3            1.7           0.5  Iris-setosa
24  25            4.8           3.4            1.9           0.2  Iris-setosa
25  26            5.0           3.0            1.6           0.2  Iris-setosa
26  27            5.0           3.4            1.6           0.4  Iris-setosa
27  28            5.2           3.5            1.5           0.2  Iris-setosa
28  29            5.2           3.4            1.4           0.2  Iris-setosa
29  30            4.7           3.2            1.6           0.2  Iris-setosa
30  31            4.8           3.1            1.6           0.2  Iris-setosa
31  32            5.4           3.4            1.5           0.4  Iris-setosa
32  33            5.2           4.1            1.5           0.1  Iris-setosa
33  34            5.5           4.2            1.4           0.2  Iris-setosa
34  35            4.9           3.1            1.5           0.1  Iris-setosa
35  36            5.0           3.2            1.2           0.2  Iris-setosa
36  37            5.5           3.5            1.3           0.2  Iris-setosa
37  38            4.9           3.1            1.5           0.1  Iris-setosa
38  39            4.4           3.0            1.3           0.2  Iris-setosa
39  40            5.1           3.4            1.5           0.2  Iris-setosa
40  41            5.0           3.5            1.3           0.3  Iris-setosa
41  42            4.5           2.3            1.3           0.3  Iris-setosa
42  43            4.4           3.2            1.3           0.2  Iris-setosa
43  44            5.0           3.5            1.6           0.6  Iris-setosa
44  45            5.1           3.8            1.9           0.4  Iris-setosa
45  46            4.8           3.0            1.4           0.3  Iris-setosa
46  47            5.1           3.8            1.6           0.2  Iris-setosa
47  48            4.6           3.2            1.4           0.2  Iris-setosa
48  49            5.3           3.7            1.5           0.2  Iris-setosa
49  50            5.0           3.3            1.4           0.2  Iris-setosa

In [51]:
iris_sub = df5.loc[(df5["Species"] == "Iris-setosa") & (df5["PetalLengthCm"] >= 1.7)]
iris_sub["SepalWidthCm"].mean()

3.5999999999999996

In [16]:
df2.loc[(df2['masa'] > 0.1) & (df2['nombre_comun'] == 'gato')]

   Unnamed: 0  longitud  ancho  masa nombre_comun  observaciones
1           2         3      1   1.4         gato           11.0

In [52]:

# drop rows with missing data
print(df2)
df2.dropna() # elminar celdas vacias

   Unnamed: 0  longitud  ancho  masa nombre_comun  observaciones
0           1         2      3   5.0      caballo           13.0
1           2         3      1   1.4         gato           11.0
2           3         4      9   1.2        perro            NaN
3           4         5     12   0.8      tortuga            NaN
4           5         6      2   2.3       conejo            9.0

   Unnamed: 0  longitud  ancho  masa nombre_comun  observaciones
0           1         2      3   5.0      caballo           13.0
1           2         3      1   1.4         gato           11.0
4           5         6      2   2.3       conejo            9.0

In [121]:
# drop duplicate rows
df2.drop_duplicates(subset=None, keep='first', inplace=False)

   Unnamed: 0  Unnamed: 0.1  longitud  ancho  masa nombre_comun  observaciones
0           0             1         2      3   5.0      caballo           13.0
1           1             2         3      1   1.4         gato           11.0
2           2             3         4      9   1.2        perro            NaN
3           3             4         5     12   0.8      tortuga            NaN
4           4             5         6      2   2.3       conejo            9.0

In [123]:
# drop 1st column from dataframe
df2.drop(df2.index[0])

   Unnamed: 0  Unnamed: 0.1  longitud  ancho  masa nombre_comun  observaciones
2           2             3         4      9   1.2        perro            NaN
3           3             4         5     12   0.8      tortuga            NaN
4           4             5         6      2   2.3       conejo            9.0

In [53]:
# sort rows by 2nd column
df2.sort_values(by=['ancho']) # ordenar

   Unnamed: 0  longitud  ancho  masa nombre_comun  observaciones
1           2         3      1   1.4         gato           11.0
4           5         6      2   2.3       conejo            9.0
0           1         2      3   5.0      caballo           13.0
2           3         4      9   1.2        perro            NaN
3           4         5     12   0.8      tortuga            NaN

In [56]:
df5.sort_values(by=["PetalLengthCm", "SepalLengthCm"])

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
22,23,4.6,3.6,1.0,0.2,Iris-setosa
13,14,4.3,3.0,1.1,0.1,Iris-setosa
35,36,5.0,3.2,1.2,0.2,Iris-setosa
14,15,5.8,4.0,1.2,0.2,Iris-setosa
38,39,4.4,3.0,1.3,0.2,Iris-setosa
...,...,...,...,...,...,...
131,132,7.9,3.8,6.4,2.0,Iris-virginica
105,106,7.6,3.0,6.6,2.1,Iris-virginica
117,118,7.7,3.8,6.7,2.2,Iris-virginica
122,123,7.7,2.8,6.7,2.0,Iris-virginica
118,119,7.7,2.6,6.9,2.3,Iris-virginica

In [125]:
# convert Strings in 4th column to title-case
df2['nombre_comun'].str.upper()

0    CABALLO
1       GATO
2      PERRO
3    TORTUGA
4     CONEJO
Name: nombre_comun, dtype: object

# Agregación de información a un DataFrame

In [19]:
df4 = pd.read_csv('df4.csv')
print(df4)

    familia  masa nombre_comun  observaciones
0  mamifero   5.0      caballo           13.0
1  mamifero   1.4         gato           11.0
2  mamifero   1.2        perro            NaN
3       pez   0.1       pirana            NaN
4    reptil   2.3    serpiente            9.0
5       pez   1.8      tilapia           10.0
6       pez   0.8        carpa            NaN

In [21]:
# Agregación de valores
df4.groupby('familia').mean().reset_index()

    familia      masa  observaciones
0  mamifero  2.533333           12.0
1       pez  0.900000           10.0
2    reptil  2.300000            9.0

# Union de datos

* Merge df3 with df4 on columns c, d and e. Change columns with same names in a meaningful way.

* Now perform a full outer join of the data, to keep all rows contained in either of the two dataframes.

In [23]:
pd.º
# Merge df3 with df4 inner join
pd.merge(df2, df4, on=['masa', 'nombre_comun', 'observaciones'], how='inner') # inner= lo que tienen en comun
# outer = lo que no tienen  en comun todo 
# left = se cogen todos los datos de df2 y del segundo se coje especificamente 
# rihgt = se cogen todos los datos de la derecha y del de la izquierda solo las especificadas

   Unnamed: 0  longitud  ancho  masa nombre_comun  observaciones   familia
0           1         2      3   5.0      caballo           13.0  mamifero
1           2         3      1   1.4         gato           11.0  mamifero
2           3         4      9   1.2        perro            NaN  mamifero

In [228]:
# Merge df3 with df4 outer join
pd.merge(df3, df4, on=['c', 'd', 'e'], how='outer')

    b_x    c         d     e      b_y
0   3.0  5.0     horse  13.0   mammal
1   1.0  1.4       cat  11.0   mammal
2   9.0  1.2       dog   NaN   mammal
3  12.0  0.8  tortoise   NaN      NaN
4   2.0  2.3    rabbit   9.0      NaN
5   NaN  0.1  goldfish   NaN     fish
6   NaN  2.3     snake   9.0  reptile
7   NaN  1.8       koi  10.0     fish
8   NaN  0.8      carp   NaN     fish